; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v2 - type_3 ?v4 - type_1)
 	      (pred_3 ?v5 - object ?v4 - type_1)
	      (pred_1 ?v2 - type_3 ?v6 - type_2)
	      (pred_4 ?v2 - type_3 ?v5 - object ?v6 - type_2))

   (:action op_1
       :parameters  (?v2 - type_3 ?v8 ?v7 - type_1)
       :precondition (and  (pred_2 ?v2 ?v8))
       :effect (and  (pred_2 ?v2 ?v7)
		     (not (pred_2 ?v2 ?v8))))

   (:action op_3
       :parameters (?v2 - type_3 ?v1 - object ?v3 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_3 ?v1 ?v3) (pred_2 ?v2 ?v3) (pred_1 ?v2 ?v6))
       :effect (and (pred_4 ?v2 ?v1 ?v6)
		    (not (pred_3 ?v1 ?v3)) 
		    (not (pred_1 ?v2 ?v6))))

   (:action op_2
       :parameters (?v2 - type_3 ?v1 - object ?v3 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v1 ?v6) (pred_2 ?v2 ?v3))
       :effect (and (pred_3 ?v1 ?v3)
		    (pred_1 ?v2 ?v6)
		    (not (pred_4 ?v2 ?v1 ?v6)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_06 - type_3
obj_05 obj_03 - type_2
obj_07 obj_02 obj_09 - type_1
obj_08 obj_04 obj_01 - object)
(:init
(pred_2 obj_06 obj_09)
(pred_1 obj_06 obj_05)
(pred_1 obj_06 obj_03)
(pred_3 obj_08 obj_07)
(pred_3 obj_04 obj_09)
(pred_3 obj_01 obj_09)
)
(:goal
(and
(pred_3 obj_08 obj_02)
(pred_3 obj_04 obj_09)
(pred_3 obj_01 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_06 ?b obj_03))))
)
)

; plan
1. (op_1 obj_06 obj_09 obj_07)
   deleted: (pred_2 obj_06 obj_09)
   added: (pred_2 obj_06 obj_07)
   goals met: 2 of 3
2. (op_3 obj_06 obj_08 obj_07 obj_05)
   deleted: (pred_3 obj_08 obj_07) (pred_1 obj_06 obj_05)
   added: (pred_4 obj_06 obj_08 obj_05)
   goals met: 2 of 3
3. (op_1 obj_06 obj_07 obj_02)
   deleted: (pred_2 obj_06 obj_07)
   added: (pred_2 obj_06 obj_02)
   goals met: 2 of 3
4. (op_2 obj_06 obj_08 obj_02 obj_05)
   deleted: (pred_4 obj_06 obj_08 obj_05)
   added: (pred_3 obj_08 obj_02) (pred_1 obj_06 obj_05)
   goals met: 3 of 3
